app/views/marks/index.html.erb

               <td>
                <% course_subject['marks'].each do |mark| %>
---
SELECT `marks`.* FROM `marks`