app/controllers/marks_controller.rb

  def index
    @marks = Mark.all
---
SELECT `marks`.* FROM `marks`