app/controllers/welcome_controller.rb

SELECT  `students`.* FROM `students`  ORDER BY `students`.`id` ASC LIMIT 1
---
  def set_student
    @student = Student.first